''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
###---if, elif, else---###
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
# 1.주머니에 돈이 있으면 택시를 타고 가고, 주머니에 돈은 없지만 카드가 있으면 택시를 타고 가고, 돈도 없고 카드도 없으면 걸어가라.

'''
pocket = ['Money', 'Wallet','Card']
if 'Money' in pocket:
    print('1.택시를 타라.')

elif 'Card' in pocket:
    print('2.택시를 타라.')

else:
    print('걸어가라.')
'''

# 2.돈이 3000원 이상 있거나 카드가 있다면 택시를 타고 가고, 그렇지 않으면 걸어가라.

'''
money = 2000
pocket = ['Money', 'Wallet','Card']

if money >= 3000:               # *>= 사용할 것*
    print('1.택시를 타라.')
elif 'Card1' in pocket:
    print('2.택시를 타라.')
else:
    print('걸어가라')
'''

# ---------------- #

'''
money = 2500
Card = True                     # *True 활용*

if money >= 3000 or Card:
    print('ride taxi')
else:
    print('walk')
'''

# 3.만약 주머니에 돈이 있으면 택시를 타고 가고, 없으면 걸어가라.

'''
pocket = ['Money', 'Wallet','Card']
if 'Money' in  pocket:
    print('ride taxi')
else:
    print('walk')
'''

# 4.주머니에 돈이 3000원 이상 있으면 택시를 타고 가고, 주머니에 돈은 없지만 카드가 있으면 택시를 타고 가고, 돈도 없고 카드도 없으면 걸어가라.

'''
pocket = ['Money', 'Wallet','Card']
money = 2500
Card = False

if money >= 3000 or Card:
    print('Ride taxi')
else:
    print('walk')
'''

''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
###---for---###
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''

